[
    {
        "image": "https://enterpriseleague.com/public/img/press/startupinfo.png",
        "title": "Enterprise League, Building the Fastest Growing Business Platform for Companies",
        "description": "That’s why it is important to optimize the way we gather and analyze user feedback. When creating our feedback forms, we focus on addressing"
    },
    {
        "image": "https://enterpriseleague.com/public/img/featured/business-insider-logo.png",
        "title": "Best online business communities",
        "description": "Enterprise League is a platform that connects SMEs, enabling them to find business partnerships and collaborations. The Al-powered online platform allows users to screen potential"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/classicinformatics.png",
        "title": "Best Business Apps",
        "description": "Irina Georgieva, Co-Founder & CEO of Enterprise League tells that ‘Enterprise League’ is the fastest growing business platform for startups and SMEs, having acquired circa 100K users in 2020 alone."
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/startup.png",
        "title": "Top 101 small and medium businesses and startups",
        "description": "At Enterprise League, we are passionate about helping people improve the way they do business. We are on a mission to help millions of entrepreneurs expand their business horizon and"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/uknews.png",
        "title": "Business platform Enterprise League sees unprecedented user growth",
        "description": "Enterprise League is extremely proud to share such results particularly since it is facilitating the way companies collaborate during these difficult times we are facing. We are constantly collecting first-"
    },
    {
        "image": "https://enterpriseleague.com/public/img/featured/umi.png",
        "title": "Startup Stories: Enterprise League",
        "description": "Enterprise League (EL) is a B2B platform for SMEs. Through EL’s platform, small businesses can advertise what their value offerings are for free and search for other firms they can do business with."
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/upgrade.png",
        "title": "5 Cost effective ways to scale up your business",
        "description": "Many entrepreneurs around the world are under constant pressure to scale up their businesses. They repeatedly receive different bits of advice from both investors and advisors. One side wants to scale your business fast, whilst the other advises you to do go through the process patiently and"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/upjourney.png",
        "title": "How to Stop Feeling Overwhelmed at Work (121 Powerful Tips)",
        "description": "At some point, you must realize that you need to change something if you want to keep your health and sanity, and still succeed with your business. I understood that, adapted to the situation and"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/prmoment.png",
        "title": "Reasons to be Cheerful about Brexit",
        "description": "We are expecting to fare even better as there will be an increasing need to connect EU and UK SMEs to work together. As we are breaking walls between countries, we are witnessing a lot of connections between companies from the same"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/globalapptesting.png",
        "title": "Time Management Techniques from CTOs",
        "description": "As a CTO the most important things for me are the productivity & efficiency of my team. Considering the fast-paced & information-saturated world we live in, it is crucial for us to be clear about the priorities for the team and how that reflects our"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/cydomedia.png",
        "title": "3 Entrepreneurs provide advice on leading teams with remote employees",
        "description": "At Enterprise League, people are our most valuable resources. Their contribution helps us keep the business platform running and growing despite the pandemic crisis we are currently facing."
    },
    {
        "image": "https://enterpriseleague.com/public/img/featured/tech-round-logo.png",
        "title": "Interview with Irina Georgieva, Co-founder and CEO of Enterprise League",
        "description": "We can expect to see Enterprise League to play a significant part in helping businesses out of the crisis caused by the pandemic. Many companies will turn to the platform in search for business"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/harmonizelyblog.png",
        "title": "10+ insightful tips for new managers",
        "description": "In order to unleash your employees’ full potential, you must give them responsibilities. Allocate each employee processes which they own and manage independently. Your role will be to provide them"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/usco.png",
        "title": "Ways to cut overhead costs",
        "description": "Review your marketing mix [and] compare how much you are spending and gaining from each channel. If, for example, you are investing a lot in PR … but you don’t see a significant increase in"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/mycorporation.png",
        "title": "Work from home outfit",
        "description": "A simple day dress is my to-go WFH outfit. It is easy to wear, and often very comfortable for long hours spent sitting on a desk. The main reasoning behind this type of outfit is to wear something that isn’t"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/welivetobuild.png",
        "title": "CEO Interview - Irina Georgieva",
        "description": "The original idea was to bring more business opportunities to small companies around the world by giving them direct access to potential business collaborations and eliminate the need to rely on the middleman. This is still at the core of what we"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/carolroth.png",
        "title": "Positive Mindset Tips for Small Business",
        "description": "Focus on the things/aspects of your work that you can control. Be rational, put your energy towards identifying ways you can adapt your business e.g., increase your online presence, join seminars, do online networking, etc. Key is to think of ways to adapt your practices to fit the current situation we"
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/workclub.png",
        "title": "Future of Works Interview - Irina Georgieva",
        "description": "Our goal has been to be very agile in terms of our employee performance and their processes. Thus we introduced monthly employee performance reviews to help us identify bottlenecks in a timely manner and work on eliminating these."
    },
    {
        "image": "https://enterpriseleague.com/public/img/press/beyourown.png",
        "title": "Business Education for female entrepreneurs",
        "description": "The number of female entrepreneurs has been on the rise in recent years and now more than ever women are aspiring to achieve financial freedom. However, it is a fact that many are discouraged by the huge gap of knowledge they are faced with. Not knowing where to start and what steps they need to take, keeps women stuck in their 9-5"
    }
]